[
    {
        "Timestamp": "2023-09-22 19:56:28",
        "Entry": "This morning the speech therapies came. She said that Alexon, Kayden therapies is writing her research paper. We spoke about the time when the people fixing the streets are coming and why I haven't cut the grass. Kayden let her know that he cut his body on the bike. Whatever they did today Kayden was not that interested about. He came to my office saying that he was done way before he actually was. Gabriel was with me using his Ipad. \nI did not do the stock market as I am not excited on how it is going sideway. Also, I worked on Physics assignment today. I was late to class because we worked on it until about 12:20. Then I went to class where we worked on a cannon to find the velocity of the ball. Part one we measure the height of the cannon and the range the ball cover at 0 and 30 degrees. Part two we tested it against the computer. We did not convert the numbers to meters. Kiran said he would. Also, we had a partner named Kamila. I had a hard time remembering her name. \nI arrived home ate some food. My wife only made one chicken so i ended up snacking up on crackers, banana and cupcake. I have calculus three HW I'm doing to prepare for quiz 3 this Sunday but I feel so lazy right now. "
    },
    {
        "Timestamp": "2023-09-23 21:48:14",
        "Entry": "Today Kirshley worked out at Field of fame in preparation for her army PT test. Then she came home and we drove to the Apple store to pick up my apple iWatch. I did not know that I was supposed to update my phone so we spent about an hour updating our phone. Then we sync the phone and watch. The representative helped me change the watch face and turn off sound notification. I was dissappointed because I wanted to get help with hand gesture and setting up alerts for calendar events. Since I bought the watch for the purpose of lucid dreaming I don't want the watch to wake up my wife when the watch wakes me up. While we waited the kids had some emotional outburst, specifically Gabriel. Kayden got upset that I kept playing with Gabriel and started showing a sad face. Prior to that we played with rolling a ball. Kirshley got upset that I wanted the guy to setup my watch as opposed to asking her for help. Then later on we went to pick up food for Kirshley at so fresh. \nI am working on become aware of where I am so I decided not to use the GPS. She got mad at me because at the apple store I didn't have her setup my watch, going to so fresh I took the high way, and leaving so fresh I said I am not going to use the GPS. She is trying to learn how to go places but she used the GPS to get there. She doesn't feel like I am confident where I am going.\nI think the big issue was that she doesn't feel like I ask her for help. I told her that I can't ask her for help when she decides to gaslight me everytime I ask her a question. For example, I asked her to dim the light on thee iwatch but instead of doing what I asked, she proceeded to tell me that the watch dims when just like hers. While driving I change the setting and said, you see you don't take me serious. I made the changes I asked of you.\" Later, we drove home and i went to lechonera. I got food for me and the kids. We returned an item and got new games for the kids at Barnes and Noble. When we got home, they played with the toys and I ate at the couched so that I can spend time with my wife and kids. I knew she was mad so I wanted to make her feel appreciated for bying my watch and being so supportive.\nI went to the bathroom prior to going to see Howard. I went to the Library late as usual. When I got there, Howard was sitting at our usual spots. We discuss how things went when he went to his grandkids take grandparents to school. He said that he doesn't like how they do things at school. Then he spoke about how 7th graders don't know how do to multiplication because they struggle at basic math. One of the excuses was that their parents are not around. I told him that my mom worked 6 am to 8 pm. Either way the kids are struggling at school and he is trying to help them out. Then he help me learn universal generalization and universal instantiation. The way the professor explains things is very confusing and he took the confusion out of it. It was a very positive interaction. "
    }
]