[
    {
        "Date": "2023-09-09",
        "Categories": {
            "Emotional Tone": "Interested",
            "Symbols": "party",
            "Themes": "Mystery",
            "Time Period": "Never been there",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "Classmate",
            "Physical Sensations": "None",
            "Dream Setting": "Mansion"
        },
        "Dream": "I got invited to a party. The invitation was a kid's drawing of a picture. I didn't  know how the people were. For some reason I go to the place. No one is there to welcome me. So I look around. I end up in a room with a tv. The room has big doors. I sit down and start watching tv. People are walking the house. Then I go to get a blanket to put on myself. When I go to grab it. it turns out there is someone there. Is a female. She tells me to get out. I'm ready to leave but she wants to throw me out. We argue to let me just walk out.",
        "Interpretation": "The person who room I was in was a classmate I once spoke to in calculus II (Brazilian).  The things about dreams is that you just appear in places. You never know how you get there. "
    },
    {
        "Date": "2023-09-10",
        "Categories": {
            "Emotional Tone": "Exciting",
            "Symbols": "Levitating",
            "Themes": "Learning a Skill",
            "Time Period": "Imaginary",
            "Lucidity Level": "Partially Lucid",
            "People and Relationships": "Teacher and Student",
            "Physical Sensations": "Flying Sensation",
            "Dream Setting": "University or College"
        },
        "Dream": "I am at school. I was taught a technique that allows me to levitate. It was a breath technique that allows me to rise up to the 4th floor but no higher. I didn't know but I felt that the teacher would know why I could only levitate up to the 4th floor. I thought it had to do with max height of plumbing. I met the instructor who is a new teacher. He had a dead African American woman layed out on the mat. Someone let him know she was deceased. he grabbed her and roughly moved her away from us. You can see her limp body stuck in the position he left her. Her stomach was sticking out. He was unphased  by it. I was ashamed to see her like that. I though, am empty shell remains. At the same time I started seeing some kids clothing and my boxers. The martial art instructor was upset. It was an awkward situation. The instructor room was caged in by a black metal fence, similar to MMA octagon fence but the room looked like it was the custodian room. ",
        "Interpretation": "Levitating should had been a sign I was dreaming. The dead body being moved and unattended should had been a dream sign"
    },
    {
        "Date": "2023-09-13",
        "Categories": {
            "Emotional Tone": "Curious and Flirtatious",
            "Symbols": "Army Uniform and Science Project",
            "Themes": "Attending Class",
            "Time Period": "Past mixed with Present",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "Fictitious Classmates",
            "Physical Sensations": "None",
            "Dream Setting": "University or College"
        },
        "Dream": "I was going to school wearing my army uniform. I had my captain rank on. I was on a science class team with a guy. We didn't know what the project was about. The class we were working on was science and it was in a seperate location or building form where I was. In the class people were conducting experiment in a bathroom, they surrounded a toilet. There were two female Soldier in our class. I was at the entrance to a building when the two Soldiers walked out to go to our science class. The major gives me her hat. She had a major hat as the rank was golden. I was puzzled looking at the rank. I told the major I don't have a hat. She said you are in the Army and left me with her hat. I though to myself \"I should had stayed until I made Major\". My partner and I were supposed to meet but he never showed up where I was so I assumed we miscommunicated and we were supposed to meet in class. So I went back to the classroom. Then I woke up.",
        "Interpretation": "I am preparing for a class test and I have a project I am working with two partners. It is a physics class. I need to be aware of what I am wearing since I no longer wear a uniform. I need to do reality check every time I am dong something out of the ordinary like doing experiment in a toilet. I need to think about how I got places how did I get here as a reality check because in dream I just appear places. Mention the building and school I am at. Focus on the person I am looking at."
    },
    {
        "Date": "2023-09-13",
        "Categories": {
            "Emotional Tone": "Flirting",
            "Symbols": "Holding hands",
            "Themes": "Group Setting",
            "Time Period": "Imaginary",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "Fictitious Classmate",
            "Physical Sensations": "None",
            "Dream Setting": "Classroom"
        },
        "Dream": "I used chatGPT to create formulas. I kept re-arranging symbols. The font was odd but I could read it. The font was yellow.  Second dream:    A classroom setting. This black female was  holding my hand. While she sang. I kept thiking to myself \"I'm married.\" 6 other people in the room were engaging in normal conversation witnessing this. There were a couple of table and all were round similar to my physics class. Then she began to sit down doing postures like a dance. I stepped away. She grab someones leg thining it was me. People in the room began to watch. My boss walked away. Earlier, I was talking to someone  saying \"What if school was cancelled.\" I kept thinking about doing reality check but I knew this was real so I didn't bother.",
        "Interpretation": "My wife is black could be a recurring character. "
    },
    {
        "Date": "2023-09-14",
        "Categories": {
            "Emotional Tone": "A little scared",
            "Symbols": "ghost",
            "Themes": "Renting a building Floor",
            "Time Period": "Imaginary",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "Fictitious Friends",
            "Physical Sensations": "None",
            "Dream Setting": "Restaurant and building"
        },
        "Dream": "CEO of facebook asked us to borrow $1 million. We all said no but he already agreed to rent a floor in a building. There were 4 of us in the group. After saying no we went to the building. Zac went to a room where people were making a human pyramid. Someone was wearing a golden necklace. I some how knew the people he was watching were dead. He didn't know it. When I went to tell him there were people (ghost) lined up in the hallway. I tossed a ball in the hallway for him to see it and notice what wasw going on. He came out the room and from a distance I told him. \"These are ghost.\" Then the ghost began to crowd us. There were ghost children as well. Somewhere in the end, I asked one of the female ghost, have you seen my son.",
        "Interpretation": "I am considering borring against my house but I don't think i will."
    },
    {
        "Date": "2023-09-15",
        "Categories": {
            "Emotional Tone": "Frustrated",
            "Symbols": "Super Hero Flying",
            "Themes": "Fighting Enemy Forces",
            "Time Period": "Imaginary",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "Fictitious Team",
            "Physical Sensations": "Flying Sensation",
            "Dream Setting": "Fantasy"
        },
        "Dream": "I am a super hero. We are fighting 3 charcoal color species. There was a disagreement between the team and I. When I returned we were ready to work together. As I begin to fight the enemy which came out of a cave. Someone fired artillery at us. To protect my team, I intersected the first shot which throws me into a bunch of trees. The enemy said \"fire again\" I though to myself one of my team member will intersect that one.",
        "Interpretation": "I bombed the physics test. I'm assuming that's the same as getting hit with artillery. There is a project due today and I'm expecting my team member to cover down on the fixing of errors on the project. I'm guessing I'm a super hero because I am the main character in this dream. The disagreement is my concern that they may feel I didn't participate fixing errors."
    },
    {
        "Date": "2023-09-16",
        "Categories": {
            "Emotional Tone": "Vindicated",
            "Symbols": "Confrontational",
            "Themes": "Fighting and confrontational",
            "Time Period": "Imaginary",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "Pet and Strangers",
            "Physical Sensations": "None",
            "Dream Setting": "The wood and a Building"
        },
        "Dream": "An animal put a stick for my son to lean on his back while I was holding him. Fred, our deceased dog, jumped over the fence to fight that animal. When he did he seemed outmatch two to one. So I was concerned for him and saw him as stubborn. I say that because as soon as he jumped over the fence two animals started to bite the under side of his belly from behind. As I follow him, It turned into a fair fight but it was now a human being against another. The person that represented Fred won the fight. The other group was telling that they told their guy not to fight him. They wanted to award Fred for his victory. We exchanged these words as I walked toward Fred since I did not see the fight. Before this event I am an inspector. I am in a building where the woman bathroom is flooded up to my knee. I want to fix the leak. Then inside I find an adversary trying to fight me. Im in fear since I don't. Then someone comes to help me get out of the fight. ",
        "Interpretation": "No interpretation provided."
    },
    {
        "Date": "2023-09-16",
        "Categories": {
            "Emotional Tone": "Curious",
            "Symbols": "Court room",
            "Themes": "Mystery",
            "Time Period": "Imaginary",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "Authority Figure",
            "Physical Sensations": "None",
            "Dream Setting": "Court room"
        },
        "Dream": "I was reccomended to go see a Judge. I go to the building and I am introduced to fake money as a way to pay for meals. Then I was told I need to go to the court house where the judge was and press the driver gear forward to see the judge. So, I go to the court house try to figure out how to see the judge. he is in a meeting with two people. i press the gear forward as shown on a screen. Then I am teleported to the court room. When I enter, I am seated behind the individuals speaking with the judge. The judge and the individuals end their conversation. The two individuals stand up to leave and i'm left talking to the judge. The judge is familiar with me. ",
        "Interpretation": "ask myself how did I get here? A gear to to teleported? do reality check when I am at new location to confirm I am awake. Fake money? Do a reality check. A court room to talk to a Judge? reality check. "
    },
    {
        "Date": "2023-09-17",
        "Categories": {
            "Emotional Tone": "Curious",
            "Symbols": "Podium",
            "Themes": "Learning a Skill: French Language",
            "Time Period": "Imaginary",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "Famous People",
            "Physical Sensations": "None",
            "Dream Setting": "City"
        },
        "Dream": "I tell my wife I know french A through Z. The I see President Trump speaking french in front of an audience. President Macron, of France, is kneeling in front of the podium in front of trump while he is speaking. no one in the audience can see him kneeling except me",
        "Interpretation": "I watched the matrix last night where Neo said, I know Kung Fu"
    },
    {
        "Date": "2023-09-18",
        "Categories": {
            "Emotional Tone": "Dissapointment and Shocked",
            "Symbols": "Prisoners",
            "Themes": "Disorder",
            "Time Period": "Imaginary",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "Supervisor and Subordinate",
            "Physical Sensations": "None",
            "Dream Setting": "Farm"
        },
        "Dream": "I lost control of our prisoners. The are running all over the place try to leave the prison. People on my team that were trusthworthy lose motivation. They had the sense they won't be able to become what they wanted to. It was like herding animals. The place was more like a farmland than an actual prison. There was no walls that held the prisoners  from escaping. Men power was the way the prisoners were kept from escaping. People I trusted acted out of character. ",
        "Interpretation": "I failed my quiz and did not finish my math assingment. The feeling of prisoners getting away could related to how I felt. I still need to not take what's happening for granted. I am not in charge of prisoner in a farmland. This was a good time to do a reality check. When I have emotional events such as losing trust of people who are close, do a reality check. "
    },
    {
        "Date": "2023-09-18",
        "Categories": {
            "Emotional Tone": "Curious",
            "Symbols": "Daily Life",
            "Themes": "Learning a Skill",
            "Time Period": "Recent",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "None",
            "Physical Sensations": "None",
            "Dream Setting": "My Mind"
        },
        "Dream": "I kept dreaming of doing the distance formula for my life. I had this dream twice in one night. ",
        "Interpretation": "No interpretation provided."
    },
    {
        "Date": "2023-09-19",
        "Categories": {
            "Emotional Tone": "upset",
            "Symbols": "Naked",
            "Themes": "Penis",
            "Time Period": "Imaginary",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "Father and Son",
            "Physical Sensations": "None",
            "Dream Setting": "House"
        },
        "Dream": "I was plotting point on a 3D plane.  second Dream: I was at Radavid house and his father was there. Ray and his had a disagreement. Something took place he was not involved in. He was sitting on a bed with a towel on. His father saw him and stood next to him. Took his towel off and saw him naked. he saw his naked body and focused on his small penis. Ray upset walked away. ",
        "Interpretation": "Ask my self during the day am I really witnessing this? Where am I in respect to what I am seeing? Question if this is real. "
    },
    {
        "Date": "2023-09-19",
        "Categories": {
            "Emotional Tone": "None",
            "Symbols": "Sex",
            "Themes": "Team Mission",
            "Time Period": "Imaginary",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "Fictitious Team",
            "Physical Sensations": "None",
            "Dream Setting": "House"
        },
        "Dream": "We were on a mission to take something from someone. For some reason my partner who was next to me went ahead and tried to distract the guy we targeted. Then all the sudden he and her begiin to have sex. I was telling her it was time to go now that she got what we needed from the target. However, she kept fucking. ",
        "Interpretation": "Ask how did I get here? Is this real? How come they can't see me?"
    },
    {
        "Date": "2023-09-20",
        "Categories": {
            "Emotional Tone": "Pride",
            "Symbols": "Confrontational",
            "Themes": "Game",
            "Time Period": "Imaginary",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "Fictitious Classmate and Howard",
            "Physical Sensations": "Focused Attention",
            "Dream Setting": "Cafeteria and Inside Car"
        },
        "Dream": "I played a game with 3 other people. i was proud of myself because i could beat them by myself. I end up in a lunch room. Everyone is eating but I am standing up. I'm bouncing around like a boxer while everyone is talking to each other. Someone I know waves \"Hi!\" to me. Then the cafeteria tables began to dissapear and room opened up. I was commenting how beautiful it is that it opened up. When lunch ends, everyone leaves. I felt like it was my lunch time next. i had a watch I was looking at. Sometime when I was bouncing up and down I jumped to grab a water pipe in the ceiling. The pipe was within reach. No other pipe was around except this one. Now, I am in my car. Suddenly my door opens. It reminds me of Howard saying that he began working with Aliens by his car door opening by itself. Now all the sudden someone is driving me home. ",
        "Interpretation": "Anytime I think or watch something to do with fighting, If I jump to a pipe, pass by a cafeteria or student union cafeteria do a RC. "
    },
    {
        "Date": "2023-09-21",
        "Categories": {
            "Emotional Tone": "Rejected",
            "Symbols": "Old Man",
            "Themes": "Meeting Deadlines",
            "Time Period": "Imaginary",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "Customer and Owner",
            "Physical Sensations": "None",
            "Dream Setting": "Business"
        },
        "Dream": "I am with a female partner. THere is a female that is supposed to catter to us. He calls her but she doesn't come fast enough so he tells us to leave. The man is sitting and gesutirng for us to leave. The lady arrives but he insist we leave. ",
        "Interpretation": "Every time I am with a female do a reality check as I tend to have many female who i don't know in my dream. Any time I get rejected or kicked out from somwhere ask myself is this a dream."
    },
    {
        "Date": "2023-09-22",
        "Categories": {
            "Emotional Tone": "None",
            "Symbols": "Homework",
            "Themes": "Pattern Recognition",
            "Time Period": "Recent",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "None",
            "Physical Sensations": "None",
            "Dream Setting": "Factory"
        },
        "Dream": "I'm in a factory using Discreet mathematics union symbol. As I spin the wheel I'm looking at the similar items. ",
        "Interpretation": "This class worries me so I'm thinking about it. "
    },
    {
        "Date": "2023-09-22",
        "Categories": {
            "Emotional Tone": "Exciting",
            "Symbols": "Football",
            "Themes": "Playing Football",
            "Time Period": "Imaginary",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "Fictitious Team",
            "Physical Sensations": "None",
            "Dream Setting": "Football Field"
        },
        "Dream": "I am playing football. The quarterback throws me the ball but the pass was short and hit the ground. I go back and pick up the ball. The receiver tries to tackle me down but I do a 360 spin and hit him with my right arm knocking him down. Then score a touchdown. After scoring the touchdown my football coach asked me \"HOw you did that?\" Meaning how did I dropped the guy on defense with my right hand by spinnin? I had no explanation, I just did. In this dream, Gabriel and I are on the same team. Everyone likes him. The coach tries to get others t olike another kid like they do Gabriel. ",
        "Interpretation": "I haven't played Football since I was a kid. the football hit the ground but we kept playing. There was only two players on the team. what was i wearing? how was my breathing while i ran? My son was on the same team? He is a baby."
    },
    {
        "Date": "2023-09-22",
        "Categories": {
            "Emotional Tone": "Dissapointment",
            "Symbols": "House",
            "Themes": "Buying a House",
            "Time Period": "Imaginary",
            "Lucidity Level": "Non-Lucid",
            "People and Relationships": "Fictitious Friends, Wife, Business relation",
            "Physical Sensations": "None",
            "Dream Setting": "City"
        },
        "Dream": "I am bying a house. The VA sends an appraiser there 6 pm. A friend said the appraiser is getting paid half the house price. So I said to him, to do the appraiser instead so that he can make the money. I'm so out of it that I forget to tell the VA to cancel the appraiser. When I get back home the appraiser complete his work and I get the paperwork. So now they will get paid for the work. Then I hear my wife gets the position of a LTC but gets paid like a specialist. There is a group of people we hang out with. We meet at a Cafe. ",
        "Interpretation": "VA interaction has to do with the class I may fail. I'm not notifying the VA about it. Also, I feel like I may not get school paid for all four year so i may have to get a HELOC on the house. As far as the promotion, my wife supervisor got promoted to manager. ",
        "Dream Signs": [
            "Female Partner",
            "Fighting or competition",
            "High School Friends: Ray, His Dad",
            "Deceased relative mentioned: Fred (our dog or Ghost)",
            "Emotions such as rejection, Disagreement, and anger",
            "Being told to leave",
        ]
    }
]